<template>
  <section class="expansion">
    <div class="container">
      <v-expansion-panels accordion class="expansion__panels">
        <v-expansion-panel v-for="(item, idx) in lists" :key="idx">
          <v-expansion-panel-header class="expansion__header contrast--text">
            <template #actions>
              <v-icon size="36">
                mdi-plus
              </v-icon>
            </template>
            {{ item.title }}
          </v-expansion-panel-header>
          <v-expansion-panel-content class="expansion__content contrast--text">
            {{ item.content }}
          </v-expansion-panel-content>
        </v-expansion-panel>
      </v-expansion-panels>
    </div>
  </section>
</template>

<script>
export default {
  name: 'ExpansionDefault',
  data() {
    return {
      lists: [
        {
          title: 'Какие риски являются обязательными?',
          content: 'Ипотечное страхование недвижимости — обязательное условие для получения ипотеки. Это регламентируется Федеральным законом № 102 «Об ипотеке (залоге недвижимости)». Имущество, купленное в ипотеку должно быть застраховано в течение всего срока действия кредитного договора или до момента его погашения. Другие объекты страхования заемщик выбирает по желанию. При этом следует учитывать, что при наличии страхования жизни и здоровья и риска потери права собственности в большинстве банков действует льготная процентная ставка по кредиту, и условия ее применения фиксируются кредитным договором. Экономия на процентной ставке как правило превышает расходы на страхование.'
        },
        {
          title: 'Когда оформляется полис ипотечного страхования имущества?',
          content: 'Ипотечное страхование недвижимости — обязательное условие для получения ипотеки. Это регламентируется Федеральным законом № 102 «Об ипотеке (залоге недвижимости)». Имущество, купленное в ипотеку должно быть застраховано в течение всего срока действия кредитного договора или до момента его погашения. Другие объекты страхования заемщик выбирает по желанию. При этом следует учитывать, что при наличии страхования жизни и здоровья и риска потери права собственности в большинстве банков действует льготная процентная ставка по кредиту, и условия ее применения фиксируются кредитным договором. Экономия на процентной ставке как правило превышает расходы на страхование.'
        },
        {
          title: 'Что можно застраховать в рамках ипотечного страхования?',
          content: 'Ипотечное страхование недвижимости — обязательное условие для получения ипотеки. Это регламентируется Федеральным законом № 102 «Об ипотеке (залоге недвижимости)». Имущество, купленное в ипотеку должно быть застраховано в течение всего срока действия кредитного договора или до момента его погашения. Другие объекты страхования заемщик выбирает по желанию. При этом следует учитывать, что при наличии страхования жизни и здоровья и риска потери права собственности в большинстве банков действует льготная процентная ставка по кредиту, и условия ее применения фиксируются кредитным договором. Экономия на процентной ставке как правило превышает расходы на страхование.'
        },
        {
          title: 'Страхование недвижимости',
          content: 'Ипотечное страхование недвижимости — обязательное условие для получения ипотеки. Это регламентируется Федеральным законом № 102 «Об ипотеке (залоге недвижимости)». Имущество, купленное в ипотеку должно быть застраховано в течение всего срока действия кредитного договора или до момента его погашения. Другие объекты страхования заемщик выбирает по желанию. При этом следует учитывать, что при наличии страхования жизни и здоровья и риска потери права собственности в большинстве банков действует льготная процентная ставка по кредиту, и условия ее применения фиксируются кредитным договором. Экономия на процентной ставке как правило превышает расходы на страхование.'
        },
        {
          title: 'Титульное страхование',
          content: 'Ипотечное страхование недвижимости — обязательное условие для получения ипотеки. Это регламентируется Федеральным законом № 102 «Об ипотеке (залоге недвижимости)». Имущество, купленное в ипотеку должно быть застраховано в течение всего срока действия кредитного договора или до момента его погашения. Другие объекты страхования заемщик выбирает по желанию. При этом следует учитывать, что при наличии страхования жизни и здоровья и риска потери права собственности в большинстве банков действует льготная процентная ставка по кредиту, и условия ее применения фиксируются кредитным договором. Экономия на процентной ставке как правило превышает расходы на страхование.'
        },
        {
          title: 'Какие документы понадобятся для оформления договора страхования?',
          content: 'Ипотечное страхование недвижимости — обязательное условие для получения ипотеки. Это регламентируется Федеральным законом № 102 «Об ипотеке (залоге недвижимости)». Имущество, купленное в ипотеку должно быть застраховано в течение всего срока действия кредитного договора или до момента его погашения. Другие объекты страхования заемщик выбирает по желанию. При этом следует учитывать, что при наличии страхования жизни и здоровья и риска потери права собственности в большинстве банков действует льготная процентная ставка по кредиту, и условия ее применения фиксируются кредитным договором. Экономия на процентной ставке как правило превышает расходы на страхование.'
        },
        {
          title: 'От чего зависит цена на страховку?',
          content: 'Ипотечное страхование недвижимости — обязательное условие для получения ипотеки. Это регламентируется Федеральным законом № 102 «Об ипотеке (залоге недвижимости)». Имущество, купленное в ипотеку должно быть застраховано в течение всего срока действия кредитного договора или до момента его погашения. Другие объекты страхования заемщик выбирает по желанию. При этом следует учитывать, что при наличии страхования жизни и здоровья и риска потери права собственности в большинстве банков действует льготная процентная ставка по кредиту, и условия ее применения фиксируются кредитным договором. Экономия на процентной ставке как правило превышает расходы на страхование.'
        },
        {
          title: 'Примет ли Ваш банк полис?',
          content: 'Ипотечное страхование недвижимости — обязательное условие для получения ипотеки. Это регламентируется Федеральным законом № 102 «Об ипотеке (залоге недвижимости)». Имущество, купленное в ипотеку должно быть застраховано в течение всего срока действия кредитного договора или до момента его погашения. Другие объекты страхования заемщик выбирает по желанию. При этом следует учитывать, что при наличии страхования жизни и здоровья и риска потери права собственности в большинстве банков действует льготная процентная ставка по кредиту, и условия ее применения фиксируются кредитным договором. Экономия на процентной ставке как правило превышает расходы на страхование.'
        },
        {
          title: 'Как получить подтверждение оплаты для банка?',
          content: 'Ипотечное страхование недвижимости — обязательное условие для получения ипотеки. Это регламентируется Федеральным законом № 102 «Об ипотеке (залоге недвижимости)». Имущество, купленное в ипотеку должно быть застраховано в течение всего срока действия кредитного договора или до момента его погашения. Другие объекты страхования заемщик выбирает по желанию. При этом следует учитывать, что при наличии страхования жизни и здоровья и риска потери права собственности в большинстве банков действует льготная процентная ставка по кредиту, и условия ее применения фиксируются кредитным договором. Экономия на процентной ставке как правило превышает расходы на страхование.'
        },
        {
          title: 'Через какое время после оплаты приходит полис?',
          content: 'Ипотечное страхование недвижимости — обязательное условие для получения ипотеки. Это регламентируется Федеральным законом № 102 «Об ипотеке (залоге недвижимости)». Имущество, купленное в ипотеку должно быть застраховано в течение всего срока действия кредитного договора или до момента его погашения. Другие объекты страхования заемщик выбирает по желанию. При этом следует учитывать, что при наличии страхования жизни и здоровья и риска потери права собственности в большинстве банков действует льготная процентная ставка по кредиту, и условия ее применения фиксируются кредитным договором. Экономия на процентной ставке как правило превышает расходы на страхование.'
        },
        {
          title: 'Что делать если полис не пришел на почту после оплаты?',
          content: 'Ипотечное страхование недвижимости — обязательное условие для получения ипотеки. Это регламентируется Федеральным законом № 102 «Об ипотеке (залоге недвижимости)». Имущество, купленное в ипотеку должно быть застраховано в течение всего срока действия кредитного договора или до момента его погашения. Другие объекты страхования заемщик выбирает по желанию. При этом следует учитывать, что при наличии страхования жизни и здоровья и риска потери права собственности в большинстве банков действует льготная процентная ставка по кредиту, и условия ее применения фиксируются кредитным договором. Экономия на процентной ставке как правило превышает расходы на страхование.'
        },
        {
          title: 'Можно ли отказаться от страховки (расторгнуть)?',
          content: 'Ипотечное страхование недвижимости — обязательное условие для получения ипотеки. Это регламентируется Федеральным законом № 102 «Об ипотеке (залоге недвижимости)». Имущество, купленное в ипотеку должно быть застраховано в течение всего срока действия кредитного договора или до момента его погашения. Другие объекты страхования заемщик выбирает по желанию. При этом следует учитывать, что при наличии страхования жизни и здоровья и риска потери права собственности в большинстве банков действует льготная процентная ставка по кредиту, и условия ее применения фиксируются кредитным договором. Экономия на процентной ставке как правило превышает расходы на страхование.'
        }
      ]
    }
  }
}
</script>

<style lang="scss" scoped>
.expansion {
  &__panels {
    ::v-deep {
      .v-expansion-panel {
        border-radius: 10px;
        background: #333333;

        @media (max-width:768px) {
          background: transparent;
          border-radius: unset;
          margin-top: 0px !important;
        }

        &::before {
          @media (max-width:768px) {
            box-shadow: unset;
          }
        }

        &:not(:last-child){
          @media (max-width:768px) {
            border-bottom: 1px solid #848484;
          }
        }

        &::after {
          @media (max-width:768px) {
            content: unset;
          }
        }

        &:not(:first-child) {
          margin-top: 14px; 
        }

        .v-expansion-panel-header {
          padding: 20px;

          .v-icon {
            color: #848484;
            width: 36px;
            height: 36px;
          }
        }

        .v-expansion-panel-content__wrap {
          padding: 10px;
        }
      }

      .v-expansion-panel--active > .v-expansion-panel-header--active .v-expansion-panel-header__icon:not(.v-expansion-panel-header__icon--disable-rotate) .v-icon {
        transform: rotate(-45deg);
      }
    }
  }

  &__header {
    font-size: 20px;
    font-weight: 600;

    @media (max-width:768px) {
      font-size: 18px;
    }
  }

  &__content {
    font-size: 18px;

    @media (max-width:768px) {
      font-size: 14px;
    }
  }
}
</style>