<template>
  <section class="banner d-flex justify-center">
    <img v-if="isMobile" src="@/static/images/banner-mobile.png" alt="background" class="banner__background" />
    <img v-else-if="!isMobile" src="@/static/images/banner-desktop.png" alt="background" class="banner__background" />
    <div class="banner__content d-flex justify-center align-center">
      <div class="d-flex flex-column align-center">
        <div class="banner__title contrast--text text-center">
          Электронная торговая площадка
        </div>
        <h1 class="banner__name contrast--text mt-3 mt-md-4 text-center">
          FASTENDER
        </h1>
        <div class="banner__subtitle contrast--text text-center mt-8 mt-md-9">
          ИТ–решения для бизнеса
        </div>
        <div class="banner__subtitle contrast--text text-center mt-2 mt-md-3">
          Эффективные закупки и продажи
        </div>
        <router-link to="#fast-start">
          <v-button class="banner__button mt-11">
            Быстрый старт
          </v-button>
        </router-link>
      </div>
    </div>
    <button class="banner__callback d-flex align-center justify-center">
      <div class="banner__callback-inner d-flex align-center justify-center">
        <svg xmlns="http://www.w3.org/2000/svg" width="20" height="21" viewBox="0 0 20 21" fill="none">
          <path d="M1.70264 4.93385C1.69859 4.83008 1.6751 4.72842 1.63351 4.63469C1.59191 4.54096 1.53303 4.45699 1.46022 4.38757C1.3874 4.31816 1.30209 4.26466 1.20915 4.23013C1.1162 4.1956 1.01745 4.18071 0.918525 4.18632C0.819599 4.19194 0.722438 4.21793 0.63259 4.26283C0.542742 4.30773 0.461967 4.37065 0.394876 4.448C0.327785 4.52535 0.275692 4.61562 0.241572 4.71364C0.207452 4.81167 0.191972 4.91554 0.196017 5.01932L1.70264 4.93385ZM2.72418 0.889701C2.59026 1.04284 2.518 1.24408 2.52283 1.45045C2.52765 1.65683 2.60918 1.85199 2.75 1.99426C2.89082 2.13653 3.07978 2.21463 3.27652 2.21189C3.47326 2.20916 3.6622 2.12579 3.803 1.97961L2.72418 0.889701ZM8.47908 18.5308C8.56219 18.5875 8.6554 18.6262 8.75333 18.6446C8.85126 18.663 8.95195 18.6608 9.04958 18.6381C9.1472 18.6154 9.23982 18.5726 9.32207 18.5123C9.40431 18.452 9.47455 18.3753 9.52871 18.2866C9.58287 18.198 9.61989 18.0992 9.6376 17.9959C9.65532 17.8927 9.65338 17.787 9.63191 17.6851C9.61045 17.5832 9.56987 17.487 9.51253 17.4022C9.4552 17.3173 9.38224 17.2455 9.29789 17.1908L8.47908 18.5308ZM12.9472 18.7903C12.752 18.7474 12.5475 18.7878 12.3787 18.9028C12.2099 19.0177 12.0906 19.1978 12.0471 19.4033C12.0036 19.6089 12.0394 19.823 12.1468 19.9988C12.2541 20.1745 12.424 20.2973 12.6193 20.3403L12.9472 18.7903ZM13.5416 14.0277L14.0052 13.5212L12.9254 12.4313L12.4618 12.9378L13.5416 14.0277ZM15.5145 13.3081L17.4195 14.4687L18.1895 13.0971L16.2834 11.9365L15.5145 13.3081ZM17.7603 16.8743L16.3123 18.4516L17.3921 19.5426L18.8391 17.9642L17.7603 16.8743ZM6.21341 14.4655C2.37183 10.1597 1.76408 6.52704 1.70264 4.93385L0.196017 5.01932C0.272062 6.97123 1.00998 10.9637 5.10727 15.5554L6.21341 14.4655ZM7.68409 7.4629L7.97552 7.14427L6.8967 6.05436L6.60426 6.37299L7.68409 7.4629ZM8.25237 3.17713L7.00859 1.29591L5.76597 2.20962L7.00875 4.09084L8.25237 3.17713ZM7.14318 6.91742C6.96459 6.73442 6.78426 6.55329 6.60224 6.37405L6.6002 6.37616L6.59715 6.37933C6.57906 6.39871 6.56203 6.41914 6.54613 6.44052C6.4459 6.57742 6.36603 6.72936 6.30933 6.89104C6.2072 7.18119 6.15012 7.56524 6.21045 8.04425C6.32931 8.98539 6.90141 10.2504 8.41483 11.9481L9.52198 10.8571C8.10666 9.27132 7.76512 8.29537 7.70481 7.81425C7.67556 7.58213 7.70924 7.46079 7.72279 7.42175L7.73109 7.40171C7.72269 7.4156 7.71311 7.42866 7.70246 7.44074C7.69648 7.44791 7.69034 7.456 7.68409 7.4629L7.14318 6.91742ZM8.41484 11.947C9.92431 13.6394 11.0718 14.3041 11.9513 14.455C12.4036 14.532 12.7712 14.4697 13.0501 14.3547C13.2049 14.2915 13.3493 14.2024 13.4775 14.091L13.5131 14.0551L13.5274 14.0403C13.5298 14.0382 13.5321 14.0361 13.5345 14.034L13.5375 14.0308L13.5386 14.0287C13.5386 14.0287 13.5406 14.0277 13.0007 13.4822C12.4608 12.9378 12.4618 12.9367 12.4618 12.9356L12.4638 12.9346L12.4659 12.9314L12.472 12.9261C12.4874 12.9107 12.5033 12.896 12.5198 12.8818C12.5289 12.8755 12.5279 12.8776 12.5147 12.8829C12.4945 12.8913 12.4036 12.9251 12.2131 12.8924C11.8099 12.8228 10.9423 12.4492 9.52198 10.8571L8.41484 11.947ZM7.00859 1.29591C6.00844 -0.217086 3.97344 -0.473473 2.72418 0.889701L3.803 1.97961C4.3359 1.39931 5.26098 1.44468 5.76597 2.20962L7.00859 1.29591ZM16.3123 18.4516C16.028 18.7618 15.7335 18.9285 15.4477 18.9581L15.5757 20.5323C16.3274 20.4553 16.9407 20.0353 17.3921 19.5426L16.3123 18.4516ZM7.97552 7.14427C8.96187 6.06913 9.05129 4.38732 8.25237 3.17713L7.00975 4.09084C7.42598 4.72073 7.35013 5.56058 6.8967 6.05436L7.97552 7.14427ZM17.4195 14.4687C18.2384 14.9677 18.3849 16.1938 17.7603 16.8743L18.8391 17.9642C20.1688 16.5145 19.8173 14.0889 18.1895 13.0971L17.4195 14.4687ZM14.0052 13.5212C14.3975 13.0929 15.0028 12.9968 15.5145 13.3081L16.2834 11.9365C15.1872 11.2697 13.817 11.4606 12.9254 12.4313L14.0052 13.5212ZM9.29789 17.1908C8.31811 16.5388 7.27689 15.6567 6.21341 14.4655L5.10727 15.5554C6.25102 16.8374 7.38766 17.8049 8.47908 18.5308L9.29789 17.1908ZM15.4467 18.9581C14.6086 19.0353 13.7659 18.9787 12.9472 18.7903L12.6193 20.3403C13.5878 20.5611 14.5847 20.6259 15.5757 20.5323L15.4467 18.9581Z" fill="white"/>
        </svg>
      </div>
    </button>
  </section>
</template>

<script>
import { VButton } from '@/components/ui';
import screenSize from '@/core/mixins/screenSize';

export default {
  name: 'BannerDefault',
  components: { VButton },
  mixins: [screenSize],
  data() {
    return {
      backgrounds: [
        {
          src: './static/images/banner-mobile.png',
          breakpoints: [0, 480]
        },
        {
          src: './static/images/banner-desktop.png',
          breakpoints: [481, Infinity]
        }
      ]
    }
  }
}
</script>

<style lang="scss" scoped>
.banner {
  position: relative;

  .banner__background {
    display: block;
    width: 100%;

    @media (max-width:1440px) {
      min-height: 684px;
      width: unset;
    }

    @media (max-width:480px) {
      min-height: 460px;
    }
  }

  .banner__content {
    position: absolute;
    top: 0;
    bottom: 0;
    left: 0;
    right: 0;
  }

  .banner__title {
    font-size: 32px;
    font-weight: 600;

    @media (max-width:768px) {
      font-size: 24px;
    }
  }

  .banner__name {
    font-size: 120px;
    font-weight: 300;

    @media (max-width:768px) {
      font-size: 48px;
    }
  }

  .banner__subtitle {
    font-size: 24px;
    font-weight: 600;

    @media (max-width:768px) {
      font-size: 20px;
    }
  }

  .banner__button {
    width: 400px;

    @media (max-width:768px) {
      width: 280px;
    }
  }

  .banner__callback {
    border: 1px solid #F5F5F5;
    border-radius: 50%;
    position: absolute;
    bottom: 38px;
    right: 55px;
    background: #94C940;
    width: 52px;
    height: 52px;

    &-inner {
      border: 1px solid #F5F5F5;
      border-radius: 50%;
      width: 36px;
      height: 36px;
    }
  }
}
</style>